In [1]:
import numpy as np
import pandas as pd

In [2]:
dados = [20900,10450,4180,2090,0]
classeSocialSemIndex = pd.Series(data=dados)
classeSocialSemIndex

0    20900
1    10450
2     4180
3     2090
4        0
dtype: int64

In [3]:
dados = [20900,10450,4180,2090,0]

indice = ['A','B','C','D','E']
classeSocialComIndex = pd.Series(data=dados, index = indice)
classeSocialComIndex

A    20900
B    10450
C     4180
D     2090
E        0
dtype: int64

In [4]:
classeSocialComIndex.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [5]:
classeSocialComIndex['A']

20900

In [6]:
classeSocialComIndex['A':'C']

A    20900
B    10450
C     4180
dtype: int64

In [7]:
ClasseSocialDict = {
    'classe_A': 20900,
    'classe_B': 10450,
    'classe_C': 4180,
    'classe_D': 2090,
    'classe_E': 0
}
CasseSocialSeries = pd.Series(ClasseSocialDict)
CasseSocialSeries

classe_A    20900
classe_B    10450
classe_C     4180
classe_D     2090
classe_E        0
dtype: int64

In [8]:
aleatorio = np.random.randn(5) #cria um array aleatorio
pd.Series(aleatorio) #transforma o array em uma tabela

0   -1.230152
1    1.161920
2   -0.569764
3   -1.354375
4   -0.830670
dtype: float64

In [9]:
indice = ['A','B','C','D','E']
pd.Series(5, indice) #cria tabela com repetição de valores

A    5
B    5
C    5
D    5
E    5
dtype: int64

In [10]:
#PANDAS DATAFRAME

In [11]:
pd.DataFrame([2,4,6,8,10]) #cria uma planilha

    0
0   2
1   4
2   6
3   8
4  10

In [12]:
pd.DataFrame([2,4,6,8,10], columns=['par']) #cria uma planilha dando nome as colunas

   par
0    2
1    4
2    6
3    8
4   10

In [13]:
pd.DataFrame(CasseSocialSeries, columns=['teste'])

          teste
classe_A  20900
classe_B  10450
classe_C   4180
classe_D   2090
classe_E      0

In [14]:
pd.DataFrame({'impar' : [1,3,5,7,9]}) #cria uma planilha a partir de um objeto

   impar
0      1
1      3
2      5
3      7
4      9

In [15]:
pd.DataFrame({'impar' : [1,3,5,7,9], 'par' : [2,4,6,8,10]})

   impar  par
0      1    2
1      3    4
2      5    6
3      7    8
4      9   10

In [16]:
#CRIANDO DATAFRAME

In [17]:
NotaMatematicaDict = {
    'diegho' : 10,
    'tiago' : 8,
    'lucas' : 9.5,
    'felipe' : 6,
    'tadeu' : 4
}
NotaMatematicaSerie = pd.Series(NotaMatematicaDict)
NotaMatematicaSerie

diegho    10.0
tiago      8.0
lucas      9.5
felipe     6.0
tadeu      4.0
dtype: float64

In [18]:
NotaPortuguesDict = {
    'diegho' : 4,
    'tiago' : 6,
    'lucas' : 8,
    'felipe' : 9.5,
    'tadeu' : 10
}
NotaPortuguesSerie = pd.Series(NotaPortuguesDict)
NotaPortuguesSerie

diegho     4.0
tiago      6.0
lucas      8.0
felipe     9.5
tadeu     10.0
dtype: float64

In [19]:
Notas = pd.DataFrame({'Mantematica': NotaMatematicaSerie, 'Portugues': NotaPortuguesSerie })
Notas

        Mantematica  Portugues
diegho         10.0        4.0
tiago           8.0        6.0
lucas           9.5        8.0
felipe          6.0        9.5
tadeu           4.0       10.0

In [20]:
Notas['Portugues'].sum()

37.5

In [21]:
Notas['Media'] = (Notas['Mantematica'] + Notas['Portugues']) / 2
Notas

        Mantematica  Portugues  Media
diegho         10.0        4.0   7.00
tiago           8.0        6.0   7.00
lucas           9.5        8.0   8.75
felipe          6.0        9.5   7.75
tadeu           4.0       10.0   7.00

In [22]:
#ACESSANDO DADOS

In [23]:
Notas[['Portugues', 'Media']]

        Portugues  Media
diegho        4.0   7.00
tiago         6.0   7.00
lucas         8.0   8.75
felipe        9.5   7.75
tadeu        10.0   7.00

In [24]:
Notas[['Media', 'Portugues']]

        Media  Portugues
diegho   7.00        4.0
tiago    7.00        6.0
lucas    8.75        8.0
felipe   7.75        9.5
tadeu    7.00       10.0

In [25]:
Notas.loc['diegho']

Mantematica    10.0
Portugues       4.0
Media           7.0
Name: diegho, dtype: float64

In [26]:
Notas.iloc[2]

Mantematica    9.50
Portugues      8.00
Media          8.75
Name: lucas, dtype: float64

In [27]:
Notas['tiago':'felipe']

        Mantematica  Portugues  Media
tiago           8.0        6.0   7.00
lucas           9.5        8.0   8.75
felipe          6.0        9.5   7.75

In [28]:
Notas['Media'] > 7

diegho    False
tiago     False
lucas      True
felipe     True
tadeu     False
Name: Media, dtype: bool

In [29]:
Notas[Notas['Media'] > 7]

        Mantematica  Portugues  Media
lucas           9.5        8.0   8.75
felipe          6.0        9.5   7.75

In [30]:
Notas.T

             diegho  tiago  lucas  felipe  tadeu
Mantematica    10.0    8.0   9.50    6.00    4.0
Portugues       4.0    6.0   8.00    9.50   10.0
Media           7.0    7.0   8.75    7.75    7.0

In [31]:
Notas.values

array([[10.  ,  4.  ,  7.  ],
       [ 8.  ,  6.  ,  7.  ],
       [ 9.5 ,  8.  ,  8.75],
       [ 6.  ,  9.5 ,  7.75],
       [ 4.  , 10.  ,  7.  ]])

In [32]:
#OPERAÇOES COM DATAFRAME

In [35]:
df1 = pd.DataFrame(np.random.randint(10, size=(3,5)), columns=['A', 'B', 'C', 'D','E'])
df2 = pd.DataFrame(np.random.randint(10, size=(3,5)), columns=['A', 'B', 'C', 'D','E'])

#np.random gera numeros aleatoriaos, .randint para numeros inteiros, 
#o primeiro argumento vai dizer ate q numeto,no caso de 0 a 10, o size vai dar a quantidade de arrais e 
#a quantidade de elementos nessa ordem
#O columns vai nomear as colunas do dataframe
df1
df2

   A  B  C  D  E
0  4  2  2  6  1
1  2  3  5  9  7
2  4  4  9  7  0

df1+df2

In [36]:
df3 = pd.DataFrame(np.random.randint(10, size=(1,5)), columns=['A', 'B', 'C', 'D','E'])
df3

   A  B  C  D  E
0  5  9  8  7  9

In [37]:
df1 * df3

      A     B     C    D    E
0  15.0  36.0  48.0  0.0  9.0
1   NaN   NaN   NaN  NaN  NaN
2   NaN   NaN   NaN  NaN  NaN

In [38]:
df1.iloc[0]

A    3
B    4
C    6
D    0
E    1
Name: 0, dtype: int64

In [39]:
df1 - df1.iloc[0]

   A  B  C  D  E
0  0  0  0  0  0
1  0 -1  2  1  3
2  2  4 -2  7  5

In [40]:
df1 * 10

    A   B   C   D   E
0  30  40  60   0  10
1  30  30  80  10  40
2  50  80  40  70  60

In [41]:
df1.T

   0  1  2
A  3  3  5
B  4  3  8
C  6  8  4
D  0  1  7
E  1  4  6